Revit 2026 API

# FilterElementIdRule Properties

---

The FilterElementIdRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from FilterRule) |
|  | RuleValue | The user-supplied value against which values from a Revit document will be tested. |

#### Reference

FilterElementIdRule Class

Autodesk.Revit.DB Namespace